import { Link } from 'react-router-dom';
export default function real() {
    return (
        <Link to="/main" style={{ textDecoration: 'none', color: 'inherit', cursor: 'default' }}>
            <nav>
            <div className="navbar-container">
                <div className="navbar">
                    <div className="logo-section">Kimstagram</div>
                    <div className="searchbar-section">
                    <input placeholder="검색"></input>
                    </div>
                    <div className="actions-section">Actions</div>
                </div>

        </div>
            </nav>
            <div className="Side">
                SideBar(제발 신중하게 보고 진행하자 제발^^)
            </div>
            <div className="Activity">
                <div className="one"></div>
                <div className="one"></div>
                <div className="one"></div>
                <div className="one"></div>

            </div>
            <div className="post">
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
                여기 게시물이다.
            </div>
        </Link>
    )
}
